[Killed] Regex
Projects/DMTools/src/buckets.ts:4:21
 import { toTitleCase } from './textUtils'
 
 class Buckets {
-  private pattern = /\[(\w|:)*\]/;
+  private pattern = /\[(\w|:)\]/;
   private guardPattern = /[^A-Za-z0-9:_]/;
   private auditPattern = /\[(\w|:)*\]/g;
killedBy: Tests for Buckets.js throws an error when an unknown function prefix is encountered
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Buckets Error: unkown prefix symbol 'bad'"

Received function did not throw

[Killed] Regex
Projects/DMTools/src/buckets.ts:4:21
 import { toTitleCase } from './textUtils'
 
 class Buckets {
-  private pattern = /\[(\w|:)*\]/;
+  private pattern = /\[(\W|:)*\]/;
   private guardPattern = /[^A-Za-z0-9:_]/;
   private auditPattern = /\[(\w|:)*\]/g;
killedBy: Tests for Buckets.js throws an error when an unknown function prefix is encountered
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Buckets Error: unkown prefix symbol 'bad'"

Received function did not throw

[Killed] Regex
Projects/DMTools/src/buckets.ts:6:26
 class Buckets {
   private pattern = /\[(\w|:)*\]/;
   private guardPattern = /[^A-Za-z0-9:_]/;
-  private auditPattern = /\[(\w|:)*\]/g;
+  private auditPattern = /\[(\w|:)\]/g;
   private data: Map<string, string[]> = new Map();
   private used: Map<string, string[]> = new Map();
killedBy: Tests for Buckets.js audits for missing keys used in values
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "key2",
- ]

[Killed] BlockStatement
Projects/DMTools/src/buckets.ts:10:29
   private data: Map<string, string[]> = new Map();
   private used: Map<string, string[]> = new Map();
 
-  private resetUsed(): void {
-    this.used = new Map();
-  }
+  private resetUsed(): void {}
 
   private randIntInRange(min: number, max: number): number {
killedBy: Tests for Buckets.js choooses unique entries from a list on separate runs
statusReason: Error: Buckets Error: cannot choose more unique values than exist for key 'key1'

[Killed] BlockStatement
Projects/DMTools/src/buckets.ts:19:41
     return Math.floor(Math.random() * (max - min + 1) + min);
   }
 
-  private lookup(key: string): string[] {
-    const list: string[] | undefined = this.data.get(key);
-    if (!list) {
-      throw new Error(`Buckets Error: No entry for key ${key}`);
-    }
-    return list;
-  }
+  private lookup(key: string): string[] {}
 
   private choose(list: string[]): string {
killedBy: Tests for Buckets.js throws an error when a key is not present
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Buckets Error: No entry for key key"
Received message:   "Cannot read property 'length' of undefined"

      115 |     } else {
      116 |       stryCov_9fa48("17");
    > 117 |       return list[this.randIntInRange(0, stryMutAct_9fa48("18") ? list.length + 1 : (stryCov_9fa48("18"), list.length - 1))];

[Killed] BlockStatement
Projects/DMTools/src/buckets.ts:31:61
     return list[this.randIntInRange(0, list.length-1)];
   }
 
-  private choose2(list: string[], joiner = ' and '): string {
-    if (list.length < 2) {
-      throw new Error('Buckets Error: cannot choose2 from a list with less than two options');
-    }
-    const first: string = this.choose(list);
-    let second: string = first;
-    while (first === second) {
-      second = this.choose(list);
-    }
-    return `${first}${joiner}${second}`;
-  }
+  private choose2(list: string[], joiner = ' and '): string {}
 
   private chooseUnique(key: string): string {
killedBy: Tests for Buckets.js get both items when choosing two from a list of two items
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "one"
Received string:    "undefined"

[Killed] EqualityOperator
Projects/DMTools/src/buckets.ts:32:9
   }
 
   private choose2(list: string[], joiner = ' and '): string {
-    if (list.length < 2) {
+    if (list.length <= 2) {
       throw new Error('Buckets Error: cannot choose2 from a list with less than two options');
     }
killedBy: Tests for Buckets.js get both items when choosing two from a list of two items
statusReason: Error: Buckets Error: cannot choose2 from a list with less than two options

[Killed] ConditionalExpression
Projects/DMTools/src/buckets.ts:32:9
   }
 
   private choose2(list: string[], joiner = ' and '): string {
-    if (list.length < 2) {
+    if (true) {
       throw new Error('Buckets Error: cannot choose2 from a list with less than two options');
     }
killedBy: Tests for Buckets.js get both items when choosing two from a list of two items
statusReason: Error: Buckets Error: cannot choose2 from a list with less than two options

[Killed] EqualityOperator
Projects/DMTools/src/buckets.ts:37:12
     }
     const first: string = this.choose(list);
     let second: string = first;
-    while (first === second) {
+    while (first !== second) {
       second = this.choose(list);
     }
killedBy: Tests for Buckets.js get both items when choosing two from a list of two items
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "two"
Received string:    "one and one"

[Killed] ConditionalExpression
Projects/DMTools/src/buckets.ts:37:12
     }
     const first: string = this.choose(list);
     let second: string = first;
-    while (first === second) {
+    while (false) {
       second = this.choose(list);
     }
killedBy: Tests for Buckets.js get both items when choosing two from a list of two items
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "two"
Received string:    "one and one"

[Killed] BlockStatement
Projects/DMTools/src/buckets.ts:43:45
     return `${first}${joiner}${second}`;
   }
 
-  private chooseUnique(key: string): string {
-    // Stryker disable next-line OptionalChaining
-    if (this.used.get(key)?.length === this.data.get(key)?.length) {
-      throw new Error(`Buckets Error: cannot choose more unique values than exist for key '${key}'`);
-    }
-    let val: string;
-    do {
-       val = this.choose(this.lookup(key));
-    } while (this.used.get(key)?.includes(val))
-    if (this.used.has(key)) {
-      // Stryker disable next-line OptionalChaining
-      this.used.get(key)?.push(val);
-    } else {
-      this.used.set(key, [val]);
-    }
-    return val;
-  }
+  private chooseUnique(key: string): string {}
 
   private replacer(match: string): string {
killedBy: Tests for Buckets.js choooses unique entries from a list
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > -1
Received:   -1

[Killed] ConditionalExpression
Projects/DMTools/src/buckets.ts:45:9
 
   private chooseUnique(key: string): string {
     // Stryker disable next-line OptionalChaining
-    if (this.used.get(key)?.length === this.data.get(key)?.length) {
+    if (true) {
       throw new Error(`Buckets Error: cannot choose more unique values than exist for key '${key}'`);
     }
killedBy: Tests for Buckets.js choooses unique entries from a list
statusReason: Error: Buckets Error: cannot choose more unique values than exist for key 'key1'

[Killed] EqualityOperator
Projects/DMTools/src/buckets.ts:45:9
 
   private chooseUnique(key: string): string {
     // Stryker disable next-line OptionalChaining
-    if (this.used.get(key)?.length === this.data.get(key)?.length) {
+    if (this.used.get(key)?.length !== this.data.get(key)?.length) {
       throw new Error(`Buckets Error: cannot choose more unique values than exist for key '${key}'`);
     }
killedBy: Tests for Buckets.js choooses unique entries from a list
statusReason: Error: Buckets Error: cannot choose more unique values than exist for key 'key1'

[Killed] StringLiteral
Projects/DMTools/src/buckets.ts:46:23
   private chooseUnique(key: string): string {
     // Stryker disable next-line OptionalChaining
     if (this.used.get(key)?.length === this.data.get(key)?.length) {
-      throw new Error(`Buckets Error: cannot choose more unique values than exist for key '${key}'`);
+      throw new Error(``);
     }
     let val: string;
killedBy: Tests for Buckets.js throws an error when trying to choose more unique entries than are in a list
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Buckets Error: cannot choose more unique values than exist for key 'key1'"
Received message:   ""

      162 |         } else {
      163 |           stryCov_9fa48("37");
    > 164 |           throw new Error(stryMutAct_9fa48("38") ? `` : (stryCov_9fa48("38"), `Buckets Error: cannot choose more unique values than exist for key '${key}

[Timeout] BlockStatement
Projects/DMTools/src/buckets.ts:49:8
       throw new Error(`Buckets Error: cannot choose more unique values than exist for key '${key}'`);
     }
     let val: string;
-    do {
-       val = this.choose(this.lookup(key));
-    } while (this.used.get(key)?.includes(val))
+    do {} while (this.used.get(key)?.includes(val))
     if (this.used.has(key)) {
       // Stryker disable next-line OptionalChaining

[Killed] ConditionalExpression
Projects/DMTools/src/buckets.ts:51:14
     let val: string;
     do {
        val = this.choose(this.lookup(key));
-    } while (this.used.get(key)?.includes(val))
+    } while (false)
     if (this.used.has(key)) {
       // Stryker disable next-line OptionalChaining
killedBy: Tests for Buckets.js choooses unique entries from a list
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > -1
Received:   -1

[Killed] OptionalChaining
Projects/DMTools/src/buckets.ts:51:14
     let val: string;
     do {
        val = this.choose(this.lookup(key));
-    } while (this.used.get(key)?.includes(val))
+    } while (this.used.get(key).includes(val))
     if (this.used.has(key)) {
       // Stryker disable next-line OptionalChaining
killedBy: Tests for Buckets.js choooses unique entries from a list
statusReason: TypeError: Cannot read property 'includes' of undefined

[Killed] BlockStatement
Projects/DMTools/src/buckets.ts:52:29
     do {
        val = this.choose(this.lookup(key));
     } while (this.used.get(key)?.includes(val))
-    if (this.used.has(key)) {
-      // Stryker disable next-line OptionalChaining
-      this.used.get(key)?.push(val);
-    } else {
+    if (this.used.has(key)) {} else {
       this.used.set(key, [val]);
     }
killedBy: Tests for Buckets.js choooses unique entries from a list
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > -1
Received:   -1

[Killed] ConditionalExpression
Projects/DMTools/src/buckets.ts:52:9
     do {
        val = this.choose(this.lookup(key));
     } while (this.used.get(key)?.includes(val))
-    if (this.used.has(key)) {
+    if (true) {
       // Stryker disable next-line OptionalChaining
       this.used.get(key)?.push(val);
killedBy: Tests for Buckets.js choooses unique entries from a list
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > -1
Received:   -1

[Killed] BlockStatement
Projects/DMTools/src/buckets.ts:55:12
     if (this.used.has(key)) {
       // Stryker disable next-line OptionalChaining
       this.used.get(key)?.push(val);
-    } else {
-      this.used.set(key, [val]);
-    }
+    } else {}
     return val;
   }
killedBy: Tests for Buckets.js choooses unique entries from a list on separate runs
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > -1
Received:   -1

[Timeout] BlockStatement
Projects/DMTools/src/buckets.ts:61:43
     return val;
   }
 
-  private replacer(match: string): string {
-    const key: string = match.substring(1,match.length-1);
-    const parts = key.split(':');
-    if (parts.length > 1) {
-      switch (parts[0]) {
-          case 'uc': return this.choose(this.lookup(parts[1])).toUpperCase();
-          case 'lc': return this.choose(this.lookup(parts[1])).toLowerCase();
-          case 'tc': return toTitleCase(this.choose(this.lookup(parts[1])));
-          case 'two': return this.choose2(this.lookup(parts[1]), parts[2]);
-          case 'uniq': return this.chooseUnique(parts[1]);
-          default:
-            throw new Error(`Buckets Error: unkown prefix symbol '${parts[0]}'`);
-      }
-    }
-    return this.choose(this.lookup(key));
-  }
+  private replacer(match: string): string {}
   
   private process(item: string): string {

[Killed] EqualityOperator
Projects/DMTools/src/buckets.ts:64:9
   private replacer(match: string): string {
     const key: string = match.substring(1,match.length-1);
     const parts = key.split(':');
-    if (parts.length > 1) {
+    if (parts.length >= 1) {
       switch (parts[0]) {
           case 'uc': return this.choose(this.lookup(parts[1])).toUpperCase();
killedBy: Tests for Buckets.js loads two lists with a reference from one to the other
statusReason: Error: Buckets Error: unkown prefix symbol 'key2'

[Killed] EqualityOperator
Projects/DMTools/src/buckets.ts:64:9
   private replacer(match: string): string {
     const key: string = match.substring(1,match.length-1);
     const parts = key.split(':');
-    if (parts.length > 1) {
+    if (parts.length <= 1) {
       switch (parts[0]) {
           case 'uc': return this.choose(this.lookup(parts[1])).toUpperCase();
killedBy: Tests for Buckets.js throws an error when an unknown function prefix is encountered
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Buckets Error: unkown prefix symbol 'bad'"
Received message:   "Buckets Error: No entry for key bad:string"

      102 |         } else {
      103 |           stryCov_9fa48("15");
    > 104 |           throw new Error(stryMutAct_9fa48("16") ? `` : (stryCov_9fa48("16"), `Buckets Error: No entry for key ${key}`));

[Killed] ConditionalExpression
Projects/DMTools/src/buckets.ts:66:11
     const parts = key.split(':');
     if (parts.length > 1) {
       switch (parts[0]) {
-          case 'uc': return this.choose(this.lookup(parts[1])).toUpperCase();
+          case 'uc':
           case 'lc': return this.choose(this.lookup(parts[1])).toLowerCase();
           case 'tc': return toTitleCase(this.choose(this.lookup(parts[1])));
killedBy: Tests for Buckets.js processes a command to make strings uppercase
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "STRING2"
Received: "string2"

[Killed] ConditionalExpression
Projects/DMTools/src/buckets.ts:67:11
     if (parts.length > 1) {
       switch (parts[0]) {
           case 'uc': return this.choose(this.lookup(parts[1])).toUpperCase();
-          case 'lc': return this.choose(this.lookup(parts[1])).toLowerCase();
+          case 'lc':
           case 'tc': return toTitleCase(this.choose(this.lookup(parts[1])));
           case 'two': return this.choose2(this.lookup(parts[1]), parts[2]);
killedBy: Tests for Buckets.js processes a command to make strings lowercase
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "string2"
Received: "String2"

[Killed] ConditionalExpression
Projects/DMTools/src/buckets.ts:68:11
       switch (parts[0]) {
           case 'uc': return this.choose(this.lookup(parts[1])).toUpperCase();
           case 'lc': return this.choose(this.lookup(parts[1])).toLowerCase();
-          case 'tc': return toTitleCase(this.choose(this.lookup(parts[1])));
+          case 'tc':
           case 'two': return this.choose2(this.lookup(parts[1]), parts[2]);
           case 'uniq': return this.chooseUnique(parts[1]);
killedBy: Tests for Buckets.js processes a command to make strings titlecase
statusReason: Error: Buckets Error: cannot choose2 from a list with less than two options

[Killed] ConditionalExpression
Projects/DMTools/src/buckets.ts:69:11
           case 'uc': return this.choose(this.lookup(parts[1])).toUpperCase();
           case 'lc': return this.choose(this.lookup(parts[1])).toLowerCase();
           case 'tc': return toTitleCase(this.choose(this.lookup(parts[1])));
-          case 'two': return this.choose2(this.lookup(parts[1]), parts[2]);
+          case 'two':
           case 'uniq': return this.chooseUnique(parts[1]);
           default:
killedBy: Tests for Buckets.js get both items when choosing two from a list of two items
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "one"
Received string:    "two"

[Killed] ConditionalExpression
Projects/DMTools/src/buckets.ts:70:11
           case 'lc': return this.choose(this.lookup(parts[1])).toLowerCase();
           case 'tc': return toTitleCase(this.choose(this.lookup(parts[1])));
           case 'two': return this.choose2(this.lookup(parts[1]), parts[2]);
-          case 'uniq': return this.chooseUnique(parts[1]);
+          case 'uniq':
           default:
             throw new Error(`Buckets Error: unkown prefix symbol '${parts[0]}'`);
killedBy: Tests for Buckets.js choooses unique entries from a list
statusReason: Error: Buckets Error: unkown prefix symbol 'uniq'

[Killed] ConditionalExpression
Projects/DMTools/src/buckets.ts:71:11
           case 'tc': return toTitleCase(this.choose(this.lookup(parts[1])));
           case 'two': return this.choose2(this.lookup(parts[1]), parts[2]);
           case 'uniq': return this.chooseUnique(parts[1]);
-          default:
-            throw new Error(`Buckets Error: unkown prefix symbol '${parts[0]}'`);
+          default:
       }
     }
killedBy: Tests for Buckets.js throws an error when an unknown function prefix is encountered
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Buckets Error: unkown prefix symbol 'bad'"
Received message:   "Buckets Error: No entry for key bad:string"

      102 |         } else {
      103 |           stryCov_9fa48("15");
    > 104 |           throw new Error(stryMutAct_9fa48("16") ? `` : (stryCov_9fa48("16"), `Buckets Error: No entry for key ${key}`));

[Killed] BlockStatement
Projects/DMTools/src/buckets.ts:78:41
     return this.choose(this.lookup(key));
   }
   
-  private process(item: string): string {
-    const matches = item.match(this.pattern);
-    if (matches && matches[0]) {
-      return this.process(item.replace(this.pattern, this.replacer(matches[0])));
-    } else {
-      return item;
-    }
-  }
+  private process(item: string): string {}
 
   public audit(): string[] {
killedBy: Tests for Buckets.js throws an error when an unknown function prefix is encountered
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Buckets Error: unkown prefix symbol 'bad'"

Received function did not throw

[Killed] ConditionalExpression
Projects/DMTools/src/buckets.ts:80:9
   
   private process(item: string): string {
     const matches = item.match(this.pattern);
-    if (matches && matches[0]) {
+    if (false) {
       return this.process(item.replace(this.pattern, this.replacer(matches[0])));
     } else {
killedBy: Tests for Buckets.js throws an error when an unknown function prefix is encountered
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Buckets Error: unkown prefix symbol 'bad'"

Received function did not throw

[Killed] LogicalOperator
Projects/DMTools/src/buckets.ts:80:9
   
   private process(item: string): string {
     const matches = item.match(this.pattern);
-    if (matches && matches[0]) {
+    if (matches || matches[0]) {
       return this.process(item.replace(this.pattern, this.replacer(matches[0])));
     } else {
killedBy: Tests for Buckets.js loads and displays for a single string under a single key
statusReason: TypeError: Cannot read property '0' of null

[Killed] BlockStatement
Projects/DMTools/src/buckets.ts:82:12
     const matches = item.match(this.pattern);
     if (matches && matches[0]) {
       return this.process(item.replace(this.pattern, this.replacer(matches[0])));
-    } else {
-      return item;
-    }
+    } else {}
   }
 
killedBy: Tests for Buckets.js loads and displays for a single string under a single key
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "string1"
Received: undefined

[Killed] BlockStatement
Projects/DMTools/src/buckets.ts:87:28
     }
   }
 
-  public audit(): string[] {
-    const out: string[] = [];
-    this.data.forEach((value) => {
-      value.forEach((str) => {
-        str.match(this.auditPattern)?.forEach((match) => {
-          if(!this.has(match.substring(1,match.length-1))) {
-            out.push(match.substring(1,match.length-1));
-          }
-        })
-      })
-    });
-    return out;
-  }
+  public audit(): string[] {}
 
   public load(key: string, list: string[]): void {
killedBy: Tests for Buckets.js delivers a clean audit when empty
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] ArrayDeclaration
Projects/DMTools/src/buckets.ts:88:27
   }
 
   public audit(): string[] {
-    const out: string[] = [];
+    const out: string[] = ["Stryker was here"];
     this.data.forEach((value) => {
       value.forEach((str) => {
killedBy: Tests for Buckets.js delivers a clean audit when empty
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] BlockStatement
Projects/DMTools/src/buckets.ts:89:34
 
   public audit(): string[] {
     const out: string[] = [];
-    this.data.forEach((value) => {
-      value.forEach((str) => {
-        str.match(this.auditPattern)?.forEach((match) => {
-          if(!this.has(match.substring(1,match.length-1))) {
-            out.push(match.substring(1,match.length-1));
-          }
-        })
-      })
-    });
+    this.data.forEach((value) => {});
     return out;
   }
killedBy: Tests for Buckets.js audits for missing keys used in values
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "key2",
- ]

[Killed] BlockStatement
Projects/DMTools/src/buckets.ts:90:30
   public audit(): string[] {
     const out: string[] = [];
     this.data.forEach((value) => {
-      value.forEach((str) => {
-        str.match(this.auditPattern)?.forEach((match) => {
-          if(!this.has(match.substring(1,match.length-1))) {
-            out.push(match.substring(1,match.length-1));
-          }
-        })
-      })
+      value.forEach((str) => {})
     });
     return out;
killedBy: Tests for Buckets.js audits for missing keys used in values
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "key2",
- ]

[Killed] BlockStatement
Projects/DMTools/src/buckets.ts:91:58
     const out: string[] = [];
     this.data.forEach((value) => {
       value.forEach((str) => {
-        str.match(this.auditPattern)?.forEach((match) => {
-          if(!this.has(match.substring(1,match.length-1))) {
-            out.push(match.substring(1,match.length-1));
-          }
-        })
+        str.match(this.auditPattern)?.forEach((match) => {})
       })
     });
killedBy: Tests for Buckets.js audits for missing keys used in values
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "key2",
- ]

[Killed] OptionalChaining
Projects/DMTools/src/buckets.ts:91:9
     const out: string[] = [];
     this.data.forEach((value) => {
       value.forEach((str) => {
-        str.match(this.auditPattern)?.forEach((match) => {
+        str.match(this.auditPattern).forEach((match) => {
           if(!this.has(match.substring(1,match.length-1))) {
             out.push(match.substring(1,match.length-1));
killedBy: Tests for Buckets.js delivers a clean audit when no keys are missing
statusReason: TypeError: Cannot read property 'forEach' of null

[Killed] ConditionalExpression
Projects/DMTools/src/buckets.ts:92:14
     this.data.forEach((value) => {
       value.forEach((str) => {
         str.match(this.auditPattern)?.forEach((match) => {
-          if(!this.has(match.substring(1,match.length-1))) {
+          if(false) {
             out.push(match.substring(1,match.length-1));
           }
killedBy: Tests for Buckets.js audits for missing keys used in values
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "key2",
- ]

[Killed] ArithmeticOperator
Projects/DMTools/src/buckets.ts:92:42
     this.data.forEach((value) => {
       value.forEach((str) => {
         str.match(this.auditPattern)?.forEach((match) => {
-          if(!this.has(match.substring(1,match.length-1))) {
+          if(!this.has(match.substring(1,match.length + 1))) {
             out.push(match.substring(1,match.length-1));
           }
killedBy: Tests for Buckets.js delivers a clean audit when no keys are missing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "key2",

[Killed] ArithmeticOperator
Projects/DMTools/src/buckets.ts:93:40
       value.forEach((str) => {
         str.match(this.auditPattern)?.forEach((match) => {
           if(!this.has(match.substring(1,match.length-1))) {
-            out.push(match.substring(1,match.length-1));
+            out.push(match.substring(1,match.length + 1));
           }
         })
killedBy: Tests for Buckets.js audits for missing keys used in values
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "key2",
+   "key2]",

[Killed] BlockStatement
Projects/DMTools/src/buckets.ts:101:50
     return out;
   }
 
-  public load(key: string, list: string[]): void {
-    if (this.guardPattern.test(key)) {
-      throw new Error(`Buckets Error: can't load key '${key}'; keys are limited to A-Za-z0-9:_`);
-    }
-    if (!list.every(s => typeof s === 'string')) {
-      // Stryker disable next-line StringLiteral
-      throw new Error(`Buckets Error: attempted to load non-string data under key '${key}'`)
-    }
-    this.data.set(key, list);
-  }
+  public load(key: string, list: string[]): void {}
 
   public loadJSON(json: Record<string, unknown>): void {
killedBy: Tests for Buckets.js throws an error when loading a bad key
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Buckets Error: can't load key 'w*'; keys are limited to A-Za-z0-9:_"

Received function did not throw

[Killed] ConditionalExpression
Projects/DMTools/src/buckets.ts:102:9
   }
 
   public load(key: string, list: string[]): void {
-    if (this.guardPattern.test(key)) {
+    if (false) {
       throw new Error(`Buckets Error: can't load key '${key}'; keys are limited to A-Za-z0-9:_`);
     }
killedBy: Tests for Buckets.js throws an error when loading a bad key
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Buckets Error: can't load key 'w*'; keys are limited to A-Za-z0-9:_"

Received function did not throw

[Killed] ConditionalExpression
Projects/DMTools/src/buckets.ts:102:9
   }
 
   public load(key: string, list: string[]): void {
-    if (this.guardPattern.test(key)) {
+    if (true) {
       throw new Error(`Buckets Error: can't load key '${key}'; keys are limited to A-Za-z0-9:_`);
     }
killedBy: Tests for Buckets.js throws an error when an unknown function prefix is encountered
statusReason: Error: Buckets Error: can't load key 'key'; keys are limited to A-Za-z0-9:_

[Killed] ConditionalExpression
Projects/DMTools/src/buckets.ts:105:9
     if (this.guardPattern.test(key)) {
       throw new Error(`Buckets Error: can't load key '${key}'; keys are limited to A-Za-z0-9:_`);
     }
-    if (!list.every(s => typeof s === 'string')) {
+    if (true) {
       // Stryker disable next-line StringLiteral
       throw new Error(`Buckets Error: attempted to load non-string data under key '${key}'`)
killedBy: Tests for Buckets.js throws an error when an unknown function prefix is encountered
statusReason: Error: Buckets Error: attempted to load non-string data under key 'key'

[Killed] BooleanLiteral
Projects/DMTools/src/buckets.ts:105:9
     if (this.guardPattern.test(key)) {
       throw new Error(`Buckets Error: can't load key '${key}'; keys are limited to A-Za-z0-9:_`);
     }
-    if (!list.every(s => typeof s === 'string')) {
+    if (list.every(s => typeof s === 'string')) {
       // Stryker disable next-line StringLiteral
       throw new Error(`Buckets Error: attempted to load non-string data under key '${key}'`)
killedBy: Tests for Buckets.js throws an error when loading a value that is not a string
statusReason: Error: expect(received).toThrow(expected)

Expected asymmetric matcher: Any<Error>

Received function did not throw

[Killed] BlockStatement
Projects/DMTools/src/buckets.ts:112:56
     this.data.set(key, list);
   }
 
-  public loadJSON(json: Record<string, unknown>): void {
-    Object.entries(json).forEach(([key, value]) => {
-      if (!Array.isArray(value) || !value.every(s => typeof s === 'string')) {
-        throw new Error(`Buckets Error: attempted to load non-string JSON data under key '${key}'`)
-      }
-      this.load(key, value);
-    });
-  }
+  public loadJSON(json: Record<string, unknown>): void {}
 
   public has(key: string): boolean {
killedBy: Tests for Buckets.js loads JSON
statusReason: Error: Buckets Error: No entry for key key
