[Killed] BlockStatement
Projects/DMTools/src/buckets.ts:113:52
   }
 
   public loadJSON(json: Record<string, unknown>): void {
-    Object.entries(json).forEach(([key, value]) => {
-      if (!Array.isArray(value) || !value.every(s => typeof s === 'string')) {
-        throw new Error(`Buckets Error: attempted to load non-string JSON data under key '${key}'`)
-      }
-      this.load(key, value);
-    });
+    Object.entries(json).forEach(([key, value]) => {});
   }
 
killedBy: Tests for Buckets.js loads JSON
statusReason: Error: Buckets Error: No entry for key key

[Killed] EqualityOperator
Projects/DMTools/src/buckets.ts:114:54
 
   public loadJSON(json: Record<string, unknown>): void {
     Object.entries(json).forEach(([key, value]) => {
-      if (!Array.isArray(value) || !value.every(s => typeof s === 'string')) {
+      if (!Array.isArray(value) || !value.every(s => typeof s !== 'string')) {
         throw new Error(`Buckets Error: attempted to load non-string JSON data under key '${key}'`)
       }
killedBy: Tests for Buckets.js loads JSON
statusReason: Error: Buckets Error: attempted to load non-string JSON data under key 'key'

[Killed] ConditionalExpression
Projects/DMTools/src/buckets.ts:114:11
 
   public loadJSON(json: Record<string, unknown>): void {
     Object.entries(json).forEach(([key, value]) => {
-      if (!Array.isArray(value) || !value.every(s => typeof s === 'string')) {
+      if (true) {
         throw new Error(`Buckets Error: attempted to load non-string JSON data under key '${key}'`)
       }
killedBy: Tests for Buckets.js loads JSON
statusReason: Error: Buckets Error: attempted to load non-string JSON data under key 'key'

[Killed] BlockStatement
Projects/DMTools/src/buckets.ts:121:36
     });
   }
 
-  public has(key: string): boolean {
-    return this.data.has(key);
-  }
+  public has(key: string): boolean {}
 
   public keys(): string[] {
killedBy: Tests for Buckets.js delivers a clean audit when no keys are missing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "key2",

[Killed] BlockStatement
Projects/DMTools/src/buckets.ts:125:27
     return this.data.has(key);
   }
 
-  public keys(): string[] {
-    return [...this.data.keys()];
-  }
+  public keys(): string[] {}
 
   public get(key: string): string {
killedBy: Tests for Buckets.js returns keys that are loaded
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["key"]
Received: undefined

[Killed] BlockStatement
Projects/DMTools/src/buckets.ts:129:35
     return [...this.data.keys()];
   }
 
-  public get(key: string): string {
-    this.resetUsed();
-    return this.process(this.choose(this.lookup(key)));
-  }
+  public get(key: string): string {}
 }
 
killedBy: Tests for Buckets.js throws an error when a key is not present
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Buckets Error: No entry for key key"

Received function did not throw
