[Killed] BlockStatement
Projects/DMTools/src/textUtils.ts:2:43
 
-function toTitleCase(str: string): string {
-  return str.toLowerCase().split(' ').map((word) => {
-    return word.replace(word[0], word[0].toUpperCase());
-  }).join(' ');
-}
+function toTitleCase(str: string): string {}
 
 export { toTitleCase };
killedBy: Tests for Buckets.js processes a command to make strings titlecase
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "One Two"
Received: "undefined"

[Killed] BlockStatement
Projects/DMTools/src/textUtils.ts:3:53
 
 function toTitleCase(str: string): string {
-  return str.toLowerCase().split(' ').map((word) => {
-    return word.replace(word[0], word[0].toUpperCase());
-  }).join(' ');
+  return str.toLowerCase().split(' ').map((word) => {}).join(' ');
 }
 
killedBy: Tests for Buckets.js processes a command to make strings titlecase
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "One Two"
Received: " "

[Killed] StringLiteral
Projects/DMTools/src/textUtils.ts:5:11
 function toTitleCase(str: string): string {
   return str.toLowerCase().split(' ').map((word) => {
     return word.replace(word[0], word[0].toUpperCase());
-  }).join(' ');
+  }).join("");
 }
 
killedBy: tests for textUtils.ts renders a phrase in Title Case
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "One Two"
Received: "OneTwo"
